In [28]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [29]:
%sql sqlite:///shopingmall.db

In [65]:
%%sql
drop table customer;
drop table seller;
drop table storage;
drop table product;
drop table ordered_goods;

 * sqlite:///shopingmall.db
Done.
Done.
Done.
Done.
Done.

[]

In [66]:
%%sql
create table customer(
    customer_id     char(5) not null,
    name            varchar(20),
    address         varchar(20),
    tel             char(11),
    email           varchar(30),
    personal_num    char(13) not null,
    zip_code        char(5),
    primary key(customer_id)
);

create table seller(
    seller_id       char(5) not null,
    name            varchar(20),
    address         varchar(20),
    tel             char(11),
    primary key(seller_id)
);

create table storage(
    storage_num     char(5) not null,
    address         varcher(20),
    tel             char(11),
    primary key(storage_num)
);

create table product(
    product_id      char(5) not null,
    name            varchar(20),
    brand           varchar(20),
    size            varchar(5),
    color           varchar(10),
    stock           numeric(7,0),
    price           numeric(6,0),
    storage_num     char(5) not null,
    primary key(product_id),
    foreign key(storage_num) references storage
);

create table ordered_goods(
    order_num       char(5) not null,
    date            char(6),
    payment_status  char(1),
    customer_id     char(5) not null,
    primary key(order_num),
    foreign key(customer_id) references customer
);

 * sqlite:///shopingmall.db
Done.
Done.
Done.
Done.
Done.

[]

In [67]:
%sql select * from sqlite_master

 * sqlite:///shopingmall.db
Done.

[('table', 'customer', 'customer', 2, 'CREATE TABLE customer( customer_id     char(5) not null,\n    name            varchar(20),\n    address         varchar(20),\n    tel             char(11),\n    email           varchar(30),\n    personal_num    char(13) not null,\n    zip_code        char(5),\n    primary key(customer_id)\n)'),
 ('index', 'sqlite_autoindex_customer_1', 'customer', 4, None),
 ('table', 'seller', 'seller', 5, 'CREATE TABLE seller(\n    seller_id       char(5) not null,\n    name            varchar(20),\n    address         varchar(20),\n    tel             char(11),\n    primary key(seller_id)\n)'),
 ('index', 'sqlite_autoindex_seller_1', 'seller', 6, None),
 ('table', 'storage', 'storage', 7, 'CREATE TABLE storage(\n    storage_num     char(5) not null,\n    address         varcher(20),\n    tel             char(11),\n    primary key(storage_num)\n)'),
 ('index', 'sqlite_autoindex_storage_1', 'storage', 8, None),
 ('table', 'product', 'product', 9, 'CREATE TABLE product(\n    product_id      char(5) not null,\n    name            varchar(20),\n    brand           varchar(20),\n    size            ... (88 characters truncated) ... rice           numeric(6,0),\n    storage_num     char(5) not null,\n    primary key(product_id),\n    foreign key(storage_num) references storage\n)'),
 ('index', 'sqlite_autoindex_product_1', 'product', 10, None),
 ('table', 'ordered_goods', 'ordered_goods', 11, 'CREATE TABLE ordered_goods(\n    order_num       char(5) not null,\n    date            char(6),\n    payment_status  char(1),\n    customer_id     char(5) not null,\n    primary key(order_num),\n    foreign key(customer_id) references customer\n)'),
 ('index', 'sqlite_autoindex_ordered_goods_1', 'ordered_goods', 3, None)]

In [68]:
%%sql
insert into customer values('38293', 'Alice', 'New York', '01012345678', 'qwer@naver.com', '9909092017213', '61005');
insert into customer values('93886', 'Brian', 'Washington', '01023456789', 'wert@google.com', '8808081010102', '13579');
insert into customer values('48026', 'Chris', 'LA', '01034567890', 'erty@naver.com', '770707102345','61005');
insert into customer values('73829', 'Diana', 'Boston', '01045678901', 'rtyu@google.com','000101201234','93725');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [69]:
%sql select * from customer;

 * sqlite:///shopingmall.db
Done.

[('38293', 'Alice', 'New York', '01012345678', 'qwer@naver.com', '9909092017213', '61005'),
 ('93886', 'Brian', 'Washington', '01023456789', 'wert@google.com', '8808081010102', '13579'),
 ('48026', 'Chris', 'LA', '01034567890', 'erty@naver.com', '770707102345', '61005'),
 ('73829', 'Diana', 'Boston', '01045678901', 'rtyu@google.com', '000101201234', '93725')]

In [70]:
%%sql
insert into seller values('12345','Apeach Mart', 'San Francisco', '41512345678');
insert into seller values('13579','Bare Bear Bros', 'Otawa', '61323456789');
insert into seller values('24680','Choonsik Shop', 'Seoul', '0234567890');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [71]:
%sql select * from seller;

 * sqlite:///shopingmall.db
Done.

[('12345', 'Apeach Mart', 'San Francisco', '41512345678'),
 ('13579', 'Bare Bear Bros', 'Otawa', '61323456789'),
 ('24680', 'Choonsik Shop', 'Seoul', '0234567890')]

In [72]:
%%sql
insert into storage values('11111','Seoul','0234567890');
insert into storage values('22222','San Francisco','41512345678');
insert into storage values('33333','Otawa','61323456789');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [73]:
%sql select * from storage;

 * sqlite:///shopingmall.db
Done.

[('11111', 'Seoul', '0234567890'),
 ('22222', 'San Francisco', '41512345678'),
 ('33333', 'Otawa', '61323456789')]

In [74]:
%%sql
insert into product values('01010','Anonymous mask','Anonymous','L','White','10000','12000','22222');
insert into product values('02121','Buster','Ghost','XL','Black','1000','120000','33333');
insert into product values('10132','Canon Shooter','Fortress','3XL','Blue','3000','300000','11111');
insert into product values('23513','Dancing Cam',"Let's Dance",'S','White','100000','21000','22222');

 * sqlite:///shopingmall.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [75]:
%sql select * from product;

 * sqlite:///shopingmall.db
Done.

[('01010', 'Anonymous mask', 'Anonymous', 'L', 'White', 10000, 12000, '22222'),
 ('02121', 'Buster', 'Ghost', 'XL', 'Black', 1000, 120000, '33333'),
 ('10132', 'Canon Shooter', 'Fortress', '3XL', 'Blue', 3000, 300000, '11111'),
 ('23513', 'Dancing Cam', "Let's Dance", 'S', 'White', 100000, 21000, '22222')]

In [ ]:
%%sql
insert into ordered_goods('505012','210505','Y','');

In [76]:
%sql select * from ordered_goods;

 * sqlite:///shopingmall.db
Done.

[]